In [2]:
import pandas as pd
import numpy as np

# NaN

* 정의되지 않은 값
    * 준비되지 않은 값
    * 결측값(수집되지 않은 값)
    * 통상 NaN은 numpy.nan을 활용

### 정상적인 데이터

In [3]:
df = pd.DataFrame([88,93,89])
df

    0
0  88
1  93
2  89

In [4]:
df_na =pd.DataFrame([80,93,np.nan])
df_na

      0
0  80.0
1  93.0
2   NaN

### 결측값으로 데이터 프레임 생성

# 결측값에 대한 연산

* 정상적인 경우

In [5]:
df

    0
0  88
1  93
2  89

In [6]:
df.sum()

0    270
dtype: int64

* NaN이 있는 경우

In [7]:
df_na

      0
0  80.0
1  93.0
2   NaN

* sum은 모든 요소의 총합을 구하는 함수  
    - skipna 속성 기본값이 true: Nan 무시

In [8]:
df_na.sum()

0    173.0
dtype: float64

모든 데이터가 준비된 후 최종연산이 의미있는 경우에 설정

In [9]:
df_na.sum(skipna=False)

0   NaN
dtype: float64

* 연산자를 활용한 경우

    * 산술연산  
    NaN과 관련된 모든 연산의 결과는 NaN이다.

In [14]:
df_na +5 #원본에 브로드캐스트 연산 결과를 반환한 새로운 데이터프레임을 반환

      0
0  85.0
1  98.0
2   NaN

In [13]:
df

    0
0  88
1  93
2  89

In [12]:
df_na -5

      0
0  75.0
1  88.0
2   NaN

In [15]:
df_na * 100

        0
0  8000.0
1  9300.0
2     NaN

* 예외사항 (연산의 결과가 NaN이 아닌 경우: 비교연산 수행시)
    * NaN과의 모든 비쇼연산은 NaN이 아니라 False임(주의사항)

In [16]:
df_na

      0
0  80.0
1  93.0
2   NaN

In [17]:
df_na  > 90

       0
0  False
1   True
2  False